#include "TitleScene.h"

#include "../CommonManagers.h"

// бсбсбсбсбсбсбсбс    бсбсбсбсбсбсбс   бс   бс   бс  бсбсбсбсбсбсбсбсбс  бсбсбсбсбсбсбсбс 
// бс       бс  бс       бс  бс   бс   бс  бс          бс       бс
// бс       бс  бс       бс  бс   бс   бс  бс          бс       бс
// бсбсбсбсбсбсбсбс   бс       бс   бс бс бс бс   бсбсбсбсбсбсбсбсбс  бсбсбсбсбсбсбсбс 
// бс          бс       бс   бс бс бс бс   бс          бс     бс
// бс          бс       бс   бс бс бс бс   бс          бс      бс
// бс           бсбсбсбсбсбсбс     бс   бс    бсбсбсбсбсбсбсбсбс  бс       бс
// 
//  бсбсбс  бсбсбсбс    бсбс  
// бс     бс   бс  бс  бс 
//  бсбсбс  бсбсбсбс   бсбсбсбс 
//     бс бс     бс    бс
//  бсбсбс  бс     бс    бс
// 
// бсбсбсбсбсбсбсбс     бсбсбсбсбс    бсбс       бс   бсбсбсбсбсбсбс   бсбсбсбсбсбсбсбсбс  бсбсбсбсбсбсбсбс 
// бс       бс   бс     бс   бс бс      бс  бс       бс  бс          бс       бс
// бс       бс   бс     бс   бс  бс     бс  бс          бс          бс       бс
// бсбсбсбсбсбсбсбс    бсбсбсбсбсбсбс   бс   бс    бс  бс   бсбсбсбсбс  бсбсбсбсбсбсбсбсбс  бсбсбсбсбсбсбсбс 
// бс     бс    бс       бс  бс     бс  бс  бс       бс  бс          бс     бс
// бс      бс   бс       бс  бс      бс бс  бс       бс  бс          бс      бс
// бс       бс  бс       бс  бс       бсбс   бсбсбсбсбсбсбс   бсбсбсбсбсбсбсбсбс  бс       бс


// жг                 жд
// жв бц  Game Start   жв
// жв                 жв
// жв      Quit       жв
// жж                 же
   
int TitleScene::Init()
{
    screen[0]  = "****************************************************************************************************";
    screen[1]  = "*                                                                                                  *";
    screen[2]  = "*    бсбсбсбсбсбсбсбс    бсбсбсбсбсбсбс   бс   бс   бс  бсбсбсбсбсбсбсбсбс  бсбсбсбсбсбсбсбс                                          *";
    screen[3]  = "*    бс       бс  бс       бс  бс   бс   бс  бс          бс       бс                                         *";
    screen[4]  = "*    бс       бс  бс       бс  бс   бс   бс  бс          бс       бс                                         *";
    screen[5]  = "*    бсбсбсбсбсбсбсбс   бс       бс   бс бс бс бс   бсбсбсбсбсбсбсбсбс  бсбсбсбсбсбсбсбс                                          *";
    screen[6]  = "*    бс          бс       бс   бс бс бс бс   бс          бс     бс                                           *";
    screen[7]  = "*    бс          бс       бс   бс бс бс бс   бс          бс      бс                                          *";
    screen[8]  = "*    бс           бсбсбсбсбсбсбс     бс   бс      бсбсбс  бсбсбсбс    бс   бс                                         *";
    screen[9]  = "*                                      бс     бс   бс  бс бс                                            *";
    screen[10] = "*                                       бсбсбс  бсбсбсбс   бсбсбс                                            *";
    screen[11] = "*                                          бс бс     бс   бс                                           *";
    screen[12] = "*                                бсбсбсбсбсбсбсбс     бсбсбсбсбс    бсбс       бс   бсбсбсбсбсбсбс   бсбсбсбсбсбсбсбсбс  бсбсбсбсбсбсбсбс  *";
    screen[13] = "*                                бс       бс   бс     бс   бс бс      бс  бс       бс  бс          бс       бс *";
    screen[14] = "*                                бс       бс   бс     бс   бс  бс     бс  бс          бс          бс       бс *";
    screen[15] = "*                                бсбсбсбсбсбсбсбс    бсбсбсбсбсбсбс   бс   бс    бс  бс   бсбсбсбсбс  бсбсбсбсбсбсбсбсбс  бсбсбсбсбсбсбсбс  *";
    screen[16] = "*    жг                 жд         бс     бс    бс       бс  бс     бс  бс  бс       бс  бс          бс     бс   *";
    screen[17] = "*    жв бц  Game Start   жв         бс      бс   бс       бс  бс      бс бс  бс       бс  бс          бс      бс  *";
    screen[18] = "*    жв                 жв         бс       бс  бс       бс  бс       бсбс   бсбсбсбсбсбсбс   бсбсбсбсбсбсбсбсбс  бс       бс *";
    screen[19] = "*    жв      Quit       жв                                                                           *";
    screen[21] = "*    жж                 же                                                                           *";
    screen[22] = "*                                                                                                  *";
    screen[23] = "*                                                                                                  *";
    screen[24] = "****************************************************************************************************";

    return 0;
}

void TitleScene::Update(float deltaTime)
{
    __super::Update(deltaTime);

    if (elapsedTime < duration)
    {
        elapsedTime += deltaTime;
        if (KEYMANAGER->IsOnceKeyDown(VK_SPACE))
        {
            elapsedTime = duration;
        }

#pragma region Animation │ы░б┤┘

        float ratio = elapsedTime / duration;
        if (ratio < 0.08f)
        {
            screen[0]  = "****************************************************************************************************";
            screen[1]  = "*                                                                                                  *";
            screen[2]  = "*                                                                                                  *";
            screen[3]  = "*                                                                                                  *";
            screen[4]  = "*                                                                                                  *";
            screen[5]  = "*                                                                                                  *";
            screen[6]  = "*                                                                                                  *";
            screen[7]  = "*                                                                                                  *";
            screen[8]  = "*                                                                                                  *";
            screen[9]  = "*                                                                                                  *";
            screen[10] = "*                                                                                                  *";
            screen[11] = "*                                                                                                  *";
            screen[12] = "*                                                                                                  *";
            screen[13] = "*                                                                                                  *";
            screen[14] = "*                                                                                                  *";
            screen[15] = "*                                                                                                  *";
            screen[16] = "*                                                                                                  *";
            screen[17] = "*                                                                                                  *";
            screen[18] = "*                                                                                                  *";
            screen[19] = "*                                                                                                  *";
            screen[21] = "*                                                                                                  *";
            screen[22] = "*                                                                                                  *";
            screen[23] = "*                                          бсбсбсбс  бсбсбс                                               *";
            screen[24] = "****************************************************************************************************";
        }
        else if (ratio < 0.16f)
        {
            screen[0]  = "****************************************************************************************************";
            screen[1]  = "*                                                                                                  *";
            screen[2]  = "*                                                                                                  *";
            screen[3]  = "*                                                                                                  *";
            screen[4]  = "*                                                                                                  *";
            screen[5]  = "*                                                                                                  *";
            screen[6]  = "*                                                                                                  *";
            screen[7]  = "*                                                                                                  *";
            screen[8]  = "*                                                                                                  *";
            screen[9]  = "*                                                                                                  *";
            screen[10] = "*                                                                                                  *";
            screen[11] = "*                                                                                                  *";
            screen[12] = "*                                                                                                  *";
            screen[13] = "*                                                                                                  *";
            screen[14] = "*                                                                                                  *";
            screen[15] = "*                                                                                                  *";
            screen[16] = "*                                                                                                  *";
            screen[17] = "*                                                                                                  *";
            screen[18] = "*                                                                                                  *";
            screen[19] = "*                                     бсбсбсбсбсбсбсбсбс  бсбсбсбсбсбсбсбс                                          *";
            screen[21] = "*                                     бс          бс       бс                                         *";
            screen[22] = "*                                     бс          бс       бс                                         *";
            screen[23] = "*                                     бсбсбсбсбсбсбсбсбс  бсбсбсбсбсбсбсбс                                          *";
            screen[24] = "****************************************************************************************************";
        }
        else if (ratio < 0.24f)
        {
            screen[0]  = "****************************************************************************************************";
            screen[1]  = "*                                                                                                  *";
            screen[2]  = "*                                                                                                  *";
            screen[3]  = "*                                                                                                  *";
            screen[4]  = "*                                                                                                  *";
            screen[5]  = "*                                                                                                  *";
            screen[6]  = "*                                                                                                  *";
            screen[7]  = "*                                                                                                  *";
            screen[8]  = "*                                                                                                  *";
            screen[9]  = "*                                                                                                  *";
            screen[10] = "*                                                                                                  *";
            screen[11] = "*                                                                                                  *";
            screen[12] = "*                                                                                                  *";
            screen[13] = "*                                                                                                  *";
            screen[14] = "*                                                                                                  *";
            screen[15] = "*                                  бс  бсбсбсбсбсбсбсбсбс  бсбсбсбсбсбсбсбс                                          *";
            screen[16] = "*                                  бс  бс          бс       бс                                         *";
            screen[17] = "*                                  бс  бс          бс       бс                                         *";
            screen[18] = "*                                 бс   бсбсбсбсбсбсбсбсбс  бсбсбсбсбсбсбсбс                                          *";
            screen[19] = "*                                 бс   бс          бс     бс                                           *";
            screen[21] = "*                                 бс   бс          бс      бс                                          *";
            screen[22] = "*                                бс      бсбсбс  бсбсбсбс    бс   бс                                         *";
            screen[23] = "*                                      бс     бс   бс  бс бс                                            *";
            screen[24] = "****************************************************************************************************";
        }
        else if (ratio < 0.32f)
        {
            screen[0]  = "****************************************************************************************************";
            screen[1]  = "*                                                                                                  *";
            screen[2]  = "*                                                                                                  *";
            screen[3]  = "*                                                                                                  *";
            screen[4]  = "*                                                                                                  *";
            screen[5]  = "*                                                                                                  *";
            screen[6]  = "*                                                                                                  *";
            screen[7]  = "*                                                                                                  *";
            screen[8]  = "*                                                                                                  *";
            screen[9]  = "*                                                                                                  *";
            screen[10] = "*                                                                                                  *";
            screen[11] = "*                                                                                                  *";
            screen[12] = "*                                                                                                  *";
            screen[13] = "*                              бс   бс  бсбсбсбсбсбсбсбсбс  бсбсбсбсбсбсбсбс                                          *";
            screen[14] = "*                              бс   бс  бс          бс       бс                                         *";
            screen[15] = "*                              бс   бс  бс          бс       бс                                         *";
            screen[16] = "*                             бс бс бс   бсбсбсбсбсбсбсбсбс  бсбсбсбсбсбсбсбс                                          *";
            screen[17] = "*                             бс бс бс   бс          бс     бс                                           *";
            screen[18] = "*                             бс бс бс   бс          бс      бс                                          *";
            screen[19] = "*                            бс   бс      бсбсбс  бсбсбсбс    бс   бс                                         *";
            screen[21] = "*                                      бс     бс   бс  бс бс                                            *";
            screen[22] = "*                                       бсбсбс  бсбсбсбс   бсбсбс                                            *";
            screen[23] = "*                                          бс бс     бс   бс                                           *";
            screen[24] = "****************************************************************************************************";
        }
        else if (ratio < 0.4f)
        {
            screen[0]  = "****************************************************************************************************";
            screen[1]  = "*                                                                                                  *";
            screen[2]  = "*                                                                                                  *";
            screen[3]  = "*                                                                                                  *";
            screen[4]  = "*                                                                                                  *";
            screen[5]  = "*                                                                                                  *";
            screen[6]  = "*                                                                                                  *";
            screen[7]  = "*                                                                                                  *";
            screen[8]  = "*                                                                                                  *";
            screen[9]  = "*                                                                                                  *";
            screen[10] = "*                                                                                                  *";
            screen[11] = "*                          бс   бс   бс  бсбсбсбсбсбсбсбсбс  бсбсбсбсбсбсбсбс                                          *";
            screen[12] = "*                       бс  бс   бс   бс  бс          бс       бс                                         *";
            screen[13] = "*                       бс  бс   бс   бс  бс          бс       бс                                         *";
            screen[14] = "*                       бс   бс бс бс бс   бсбсбсбсбсбсбсбсбс  бсбсбсбсбсбсбсбс                                          *";
            screen[15] = "*                       бс   бс бс бс бс   бс          бс     бс                                           *";
            screen[16] = "*                       бс   бс бс бс бс   бс          бс      бс                                          *";
            screen[17] = "*                            бс   бс      бсбсбс  бсбсбсбс    бс   бс                                         *";
            screen[18] = "*                                      бс     бс   бс  бс бс                                            *";
            screen[19] = "*                                       бсбсбс  бсбсбсбс   бсбсбс                                            *";
            screen[21] = "*                                          бс бс     бс   бс                                           *";
            screen[22] = "*                                бсбсбсбсбсбсбсбс     бсбсбсбсбс    бсбс       бс   бсбсбс                            *";
            screen[23] = "*                                бс       бс   бс     бс   бс бс      бс  бс                               *";
            screen[24] = "****************************************************************************************************";
        }
        else if (ratio < 0.48f)
        {
            screen[0]  = "****************************************************************************************************";
            screen[1]  = "*                                                                                                  *";
            screen[2]  = "*                                                                                                  *";
            screen[3]  = "*                                                                                                  *";
            screen[4]  = "*                                                                                                  *";
            screen[5]  = "*                                                                                                  *";
            screen[6]  = "*                                                                                                  *";
            screen[7]  = "*                                                                                                  *";
            screen[8]  = "*                                                                                                  *";
            screen[9]  = "*                 бсбсбсбсбс   бс   бс   бс  бсбсбсбсбсбсбсбсбс  бсбсбсбсбсбсбсбс                                           *";
            screen[10] = "*                      бс  бс   бс   бс  бс          бс       бс                                          *";
            screen[11] = "*                      бс  бс   бс   бс  бс          бс       бс                                          *";
            screen[12] = "*                      бс   бс бс бс бс   бсбсбсбсбсбсбсбсбс  бсбсбсбсбсбсбсбс                                           *";
            screen[13] = "*                      бс   бс бс бс бс   бс          бс     бс                                            *";
            screen[14] = "*                      бс   бс бс бс бс   бс          бс      бс                                           *";
            screen[15] = "*                 бсбсбсбсбс     бс   бс      бсбсбс  бсбсбсбс    бс   бс                                          *";
            screen[16] = "*                                     бс     бс   бс  бс бс                                             *";
            screen[17] = "*                                      бсбсбс  бсбсбсбс   бсбсбс                                             *";
            screen[18] = "*                                         бс бс     бс   бс                                            *";
            screen[19] = "*                               бсбсбсбсбсбсбсбс     бсбсбсбсбс    бсбс       бс   бсбсбсбсбсбсбс                         *";
            screen[21] = "*                               бс       бс   бс     бс   бс бс      бс  бс       бс                        *";
            screen[22] = "*                               бс       бс   бс     бс   бс  бс     бс  бс                                *";
            screen[23] = "*                               бсбсбсбсбсбсбсбс    бсбсбсбсбсбсбс   бс   бс    бс  бс   бсбсбсбсбс                        *";
            screen[24] = "****************************************************************************************************";
        }
        else if (ratio < 0.56f)
        {
            screen[0]  = "****************************************************************************************************";
            screen[1]  = "*                                                                                                  *";
            screen[2]  = "*                                                                                                  *";
            screen[3]  = "*                                                                                                  *";
            screen[4]  = "*                                                                                                  *";
            screen[5]  = "*                                                                                                  *";
            screen[6]  = "*               бсбсбсбсбсбсбс   бс   бс   бс  бсбсбсбсбсбсбсбсбс  бсбсбсбсбсбсбсбс                                           *";
            screen[7]  = "*              бс       бс  бс   бс   бс  бс          бс       бс                                          *";
            screen[8]  = "*              бс       бс  бс   бс   бс  бс          бс       бс                                          *";
            screen[9]  = "*              бс       бс   бс бс бс бс   бсбсбсбсбсбсбсбсбс  бсбсбсбсбсбсбсбс                                           *";
            screen[10] = "*              бс       бс   бс бс бс бс   бс          бс     бс                                            *";
            screen[11] = "*              бс       бс   бс бс бс бс   бс          бс      бс                                           *";
            screen[12] = "*               бсбсбсбсбсбсбс     бс   бс      бсбсбс  бсбсбсбс    бс   бс                                          *";
            screen[13] = "*                                     бс     бс   бс  бс бс                                             *";
            screen[14] = "*                                      бсбсбс  бсбсбсбс   бсбсбс                                             *";
            screen[15] = "*                                         бс бс     бс   бс                                            *";
            screen[16] = "*                               бсбсбсбсбсбсбсбс     бсбсбсбсбс    бсбс       бс   бсбсбсбсбсбсбс   бсбс                    *";
            screen[17] = "*                               бс       бс   бс     бс   бс бс      бс  бс       бс  бс                     *";
            screen[18] = "*                               бс       бс   бс     бс   бс  бс     бс  бс          бс                     *";
            screen[19] = "*                               бсбсбсбсбсбсбсбс    бсбсбсбсбсбсбс   бс   бс    бс  бс   бсбсбсбсбс  бсбс                    *";
            screen[21] = "*                               бс     бс    бс       бс  бс     бс  бс  бс       бс  бс                     *";
            screen[22] = "*                               бс      бс   бс       бс  бс      бс бс  бс       бс  бс                     *";
            screen[23] = "*                               бс       бс  бс       бс  бс       бсбс   бсбсбсбсбсбсбс   бсбс                    *";
            screen[24] = "****************************************************************************************************";
        }
        else if (ratio < 0.64f)
        {
            screen[0]  = "****************************************************************************************************";
            screen[1]  = "*                                                                                                  *";
            screen[2]  = "*                                                                                                  *";
            screen[3]  = "*                                                                                                   *";
            screen[4]  = "*          бсбс    бсбсбсбсбсбсбс   бс   бс   бс  бсбсбсбсбсбсбсбсбс  бсбсбсбсбсбсбсбс                                           *";
            screen[5]  = "*            бс  бс       бс  бс   бс   бс  бс          бс       бс                                          *";
            screen[6]  = "*            бс  бс       бс  бс   бс   бс  бс          бс       бс                                          *";
            screen[7]  = "*          бсбс   бс       бс   бс бс бс бс   бсбсбсбсбсбсбсбсбс  бсбсбсбсбсбсбсбс                                           *";
            screen[8]  = "*               бс       бс   бс бс бс бс   бс          бс     бс                                            *";
            screen[9]  = "*               бс       бс   бс бс бс бс   бс          бс      бс                                           *";
            screen[10] = "*                бсбсбсбсбсбсбс     бс   бс      бсбсбс  бсбсбсбс    бс   бс                                          *";
            screen[11] = "*                                      бс     бс   бс  бс бс                                             *";
            screen[12] = "*                                       бсбсбс  бсбсбсбс   бсбсбс                                             *";
            screen[13] = "*                                          бс бс     бс   бс                                            *";
            screen[14] = "*                                бсбсбсбсбсбсбсбс     бсбсбсбсбс    бсбс       бс   бсбсбсбсбсбсбс   бсбсбсбсбсбс                *";
            screen[15] = "*                                бс       бс   бс     бс   бс бс      бс  бс       бс  бс                     *";
            screen[16] = "*                                бс       бс   бс     бс   бс  бс     бс  бс          бс                     *";
            screen[17] = "*                                бсбсбсбсбсбсбсбс    бсбсбсбсбсбсбс   бс   бс    бс  бс   бсбсбсбсбс  бсбсбсбсбсбс                *";
            screen[18] = "*                                бс     бс    бс       бс  бс     бс  бс  бс       бс  бс                     *";
            screen[19] = "*                                бс      бс   бс       бс  бс      бс бс  бс       бс  бс                     *";
            screen[21] = "*                                бс       бс  бс       бс  бс       бсбс   бсбсбсбсбсбсбс   бсбсбсбсбсбс                *";
            screen[22] = "*                                                                                                   *";
            screen[23] = "*                                                                                                   *";
            screen[24] = "****************************************************************************************************";
        }
        else if (ratio < 0.72f)
        {
            screen[0]  = "****************************************************************************************************";
            screen[1]  = "*                                                                                                  *";
            screen[2]  = "*                                                                                                  *";
            screen[3]  = "*    бсбсбсбсбсбсбсбс    бсбсбсбсбсбсбс   бс   бс   бс  бсбсбсбсбсбсбсбсбс  бсбсбсбсбсбсбсбс                                          *";
            screen[4]  = "*    бс       бс  бс       бс  бс   бс   бс  бс          бс       бс                                         *";
            screen[5]  = "*    бс       бс  бс       бс  бс   бс   бс  бс          бс       бс                                         *";
            screen[6]  = "*    бсбсбсбсбсбсбсбс   бс       бс   бс бс бс бс   бсбсбсбсбсбсбсбсбс  бсбсбсбсбсбсбсбс                                          *";
            screen[7]  = "*    бс          бс       бс   бс бс бс бс   бс          бс     бс                                           *";
            screen[8]  = "*    бс          бс       бс   бс бс бс бс   бс          бс      бс                                          *";
            screen[9]  = "*    бс           бсбсбсбсбсбсбс     бс   бс      бсбсбс  бсбсбсбс    бс   бс                                         *";
            screen[10] = "*                                      бс     бс   бс  бс бс                                            *";
            screen[11] = "*                                       бсбсбс  бсбсбсбс   бсбсбс                                            *";
            screen[12] = "*                                          бс бс     бс   бс                                           *";
            screen[13] = "*                                бсбсбсбсбсбсбсбс     бсбсбсбсбс    бсбс       бс   бсбсбсбсбсбсбс   бсбсбсбсбсбсбсбсбс  бсбсбсбсбсбсбсбс  *";
            screen[14] = "*                                бс       бс   бс     бс   бс бс      бс  бс       бс  бс          бс       бс *";
            screen[15] = "*                                бс       бс   бс     бс   бс  бс     бс  бс          бс          бс       бс *";
            screen[16] = "*                                бсбсбсбсбсбсбсбс    бсбсбсбсбсбсбс   бс   бс    бс  бс   бсбсбсбсбс  бсбсбсбсбсбсбсбсбс  бсбсбсбсбсбсбсбс  *";
            screen[17] = "*                                бс     бс    бс       бс  бс     бс  бс  бс       бс  бс          бс     бс   *";
            screen[18] = "*                                бс      бс   бс       бс  бс      бс бс  бс       бс  бс          бс      бс  *";
            screen[19] = "*                                бс       бс  бс       бс  бс       бсбс   бсбсбсбсбсбсбс   бсбсбсбсбсбсбсбсбс  бс       бс *";
            screen[21] = "*                                                                                                  *";
            screen[22] = "*                                                                                                  *";
            screen[23] = "*                                                                                                  *";
            screen[24] = "****************************************************************************************************";
        }
        else if (ratio < 0.8f)
        {
            screen[0]  = "****************************************************************************************************";
            screen[1]  = "*                                                                                                  *";
            screen[2]  = "*    бсбсбсбсбсбсбсбс    бсбсбсбсбсбсбс   бс   бс   бс  бсбсбсбсбсбсбсбсбс  бсбсбсбсбсбсбсбс                                          *";
            screen[3]  = "*    бс       бс  бс       бс  бс   бс   бс  бс          бс       бс                                         *";
            screen[4]  = "*    бс       бс  бс       бс  бс   бс   бс  бс          бс       бс                                         *";
            screen[5]  = "*    бсбсбсбсбсбсбсбс   бс       бс   бс бс бс бс   бсбсбсбсбсбсбсбсбс  бсбсбсбсбсбсбсбс                                          *";
            screen[6]  = "*    бс          бс       бс   бс бс бс бс   бс          бс     бс                                           *";
            screen[7]  = "*    бс          бс       бс   бс бс бс бс   бс          бс      бс                                          *";
            screen[8]  = "*    бс           бсбсбсбсбсбсбс     бс   бс      бсбсбс  бсбсбсбс    бс   бс                                         *";
            screen[9]  = "*                                      бс     бс   бс  бс бс                                            *";
            screen[10] = "*                                       бсбсбс  бсбсбсбс   бсбсбс                                            *";
            screen[11] = "*                                          бс бс     бс   бс                                           *";
            screen[12] = "*                                бсбсбсбсбсбсбсбс     бсбсбсбсбс    бсбс       бс   бсбсбсбсбсбсбс   бсбсбсбсбсбсбсбсбс  бсбсбсбсбсбсбсбс  *";
            screen[13] = "*                                бс       бс   бс     бс   бс бс      бс  бс       бс  бс          бс       бс *";
            screen[14] = "*                                бс       бс   бс     бс   бс  бс     бс  бс          бс          бс       бс *";
            screen[15] = "*                                бсбсбсбсбсбсбсбс    бсбсбсбсбсбсбс   бс   бс    бс  бс   бсбсбсбсбс  бсбсбсбсбсбсбсбсбс  бсбсбсбсбсбсбсбс  *";
            screen[16] = "*                                бс     бс    бс       бс  бс     бс  бс  бс       бс  бс          бс     бс   *";
            screen[17] = "*                                бс      бс   бс       бс  бс      бс бс  бс       бс  бс          бс      бс  *";
            screen[18] = "*                                бс       бс  бс       бс  бс       бсбс   бсбсбсбсбсбсбс   бсбсбсбсбсбсбсбсбс  бс       бс *";
            screen[19] = "*                                                                                                  *";
            screen[21] = "*                                                                                                  *";
            screen[22] = "*                                                                                                  *";
            screen[23] = "*                                                                                                  *";
            screen[24] = "****************************************************************************************************";
        }
        else
        {
            screen[0]  = "****************************************************************************************************";
            screen[1]  = "*                                                                                                  *";
            screen[2]  = "*    бсбсбсбсбсбсбсбс    бсбсбсбсбсбсбс   бс   бс   бс  бсбсбсбсбсбсбсбсбс  бсбсбсбсбсбсбсбс                                          *";
            screen[3]  = "*    бс       бс  бс       бс  бс   бс   бс  бс          бс       бс                                         *";
            screen[4]  = "*    бс       бс  бс       бс  бс   бс   бс  бс          бс       бс                                         *";
            screen[5]  = "*    бсбсбсбсбсбсбсбс   бс       бс   бс бс бс бс   бсбсбсбсбсбсбсбсбс  бсбсбсбсбсбсбсбс                                          *";
            screen[6]  = "*    бс          бс       бс   бс бс бс бс   бс          бс     бс                                           *";
            screen[7]  = "*    бс          бс       бс   бс бс бс бс   бс          бс      бс                                          *";
            screen[8]  = "*    бс           бсбсбсбсбсбсбс     бс   бс      бсбсбс  бсбсбсбс    бс   бс                                         *";
            screen[9]  = "*                                      бс     бс   бс  бс бс                                            *";
            screen[10] = "*                                       бсбсбс  бсбсбсбс   бсбсбс                                            *";
            screen[11] = "*                                          бс бс     бс   бс                                           *";
            screen[12] = "*                                бсбсбсбсбсбсбсбс     бсбсбсбсбс    бсбс       бс   бсбсбсбсбсбсбс   бсбсбсбсбсбсбсбсбс  бсбсбсбсбсбсбсбс  *";
            screen[13] = "*                                бс       бс   бс     бс   бс бс      бс  бс       бс  бс          бс       бс *";
            screen[14] = "*                                бс       бс   бс     бс   бс  бс     бс  бс          бс          бс       бс *";
            screen[15] = "*                                бсбсбсбсбсбсбсбс    бсбсбсбсбсбсбс   бс   бс    бс  бс   бсбсбсбсбс  бсбсбсбсбсбсбсбсбс  бсбсбсбсбсбсбсбс  *";
            screen[16] = "*    жг                 жд         бс     бс    бс       бс  бс     бс  бс  бс       бс  бс          бс     бс   *";
            screen[17] = "*    жв бц  Game Start   жв         бс      бс   бс       бс  бс      бс бс  бс       бс  бс          бс      бс  *";
            screen[18] = "*    жв                 жв         бс       бс  бс       бс  бс       бсбс   бсбсбсбсбсбсбс   бсбсбсбсбсбсбсбсбс  бс       бс *";
            screen[19] = "*    жв      Quit       жв                                                                           *";
            screen[21] = "*    жж                 же                                                                           *";
            screen[22] = "*                                                                                                  *";
            screen[23] = "*                                                                                                  *";
            screen[24] = "****************************************************************************************************";
        }

#pragma endregion

    }
    else
    {

    }
}

void TitleScene::Release()
{
}
